SE4Foam/tutorials/chtMultiRegion4SEFoam/photovoltaicPanel/system/PV/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    T
    {
        internalField   uniform 300;

        boundaryField
        {
            top
            {
                type		photovoltaic4SEFoam;
                Kappa		Kappa;
                absorptivity	1.0;
                emissivity	0.85;
                etaRef		0.13;
                betaRef		0.0041;
                TRef		298;
                qo		(800);
                ho		(6.0);
                To		(296.0);
            }

            frontAndBack
            {
                type            empty;
            }

            PV_to_channel
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName channel;
                neighbourPatchName channel_to_PV;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 300;
            }
        }
    }

    rho
    {
        internalField   uniform 7800;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            frontAndBack
            {
                type            empty;
            }

            PV_to_channel
            {
                type            zeroGradient;
            }
        }
    }

    Kappa
    {
        internalField   uniform 50;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            frontAndBack
            {
                type            empty;
            }

            PV_to_channel
            {
                type            zeroGradient;
            }
        }
    }

    cp
    {
        internalField   uniform 450;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            frontAndBack
            {
                type            empty;
            }

            PV_to_channel
            {
                type            zeroGradient;
            }
        }
    }
}


// ************************************************************************* //
